#encoding:utf-8

cities = City.create([{name: "Москва"}, {name: "Челябинск"}, {name: "Кострома"}, {name: "Саратов"}, {name: "Мурманск"}, {name: "Иркутск"}])
countries = Country.create([{name: "Россия"},{name: "СССР"},{name: "Украина"},{name: "Белорусия"},{name: "США"},{name: "Бразилия"}])

scopes = Scope.create([{name: "Информационные технологии, интернет, телеком"}, {name: "Бухгалтерия, управленческий учет, финансы предприятия"}, {name: "Маркетинг, реклама, PR"}, {name: "Административный персонал"}, {name: "Банки, инвестиции, лизинг"}, {name: "Управление персоналом, тренинги"}, {name: "Автомобильный бизнес"}, {name: "Безопасность"}, {name: "Высший менеджмент"}, {name: "Добыча сырья"}, {name: "Искусство, развлечения, масс-медиа"}, {name: "Консультирование"}, {name: "Медицина, фармацевтика"}, {name: "Наука, образование"}, {name: "Государственная служба, некоммерческие организации"}, {name: "Продажи"}, {name: "Производство"}, {name: "Страхование"}, {name: "Строительство, недвижимость"}, {name: "Транспорт, логистика"}, {name: "Туризм, гостиницы, рестораны"}, {name: "Юристы"}, {name: "Спортивные клубы, фитнес, салоны красоты"}, {name: "Инсталляция и сервис"}, {name: "Закупки"}, {name: "Начало карьеры, студенты"}, {name: "Домашний персонал"}, {name: "Рабочий персонал"}])

specializations = Specialization.create([{name: "CRM системы"}, {name: "CTO, CIO, Директор по IT"}, {name: "Web инженер"}, {name: "Web мастер"}, {name: "Администратор баз данных"}, {name: "Аналитик"}, {name: "Арт-директор"}, {name: "Банковское ПО"}, {name: "Игровое ПО"}, {name: "Инженер"}, {name: "Интернет"}, {name: "Компьютерная безопасность"}, {name: "Консалтинг, Аутсорсинг"}, {name: "Контент"}, {name: "Маркетинг"}, {name: "Мультимедиа"}, {name: "Начальный уровень, Мало опыта"}, {name: "Оптимизация сайта (SEO)"}, {name: "Передача данных и доступ в интернет"}, {name: "Поддержка, Helpdesk"}, {name: "Программирование, Разработка"}, {name: "Продажи"}, {name: "Продюсер"}, {name: "Развитие бизнеса"}, {name: "Сетевые технологии"}, {name: "Системная интеграция"}, {name: "Системный администратор"}, {name: "Системы автоматизированного проектирования"}, {name: "Системы управления предприятием (ERP)"}, {name: "Сотовые, Беспроводные технологии"}, {name: "Стартапы"}, {name: "Телекоммуникации"}, {name: "Тестирование"}, {name: "Технический писатель"}, {name: "Управление проектами"}, {name: "Электронная коммерция"}])
specializations.each{|s| s.scope = Scope.find_by_name("Информационные технологии, интернет, телеком"); s.save}

specializations = Specialization.create([{name: "ACCA"}, {name: "CIPA"}, {name: "GAAP"}, {name: "Аудит"}, {name: "Бухгалтер"}, {name: "Бухгалтер-калькулятор"}, {name: "Бюджетирование и планирование"}, {name: "Валютный контроль"}, {name: "Казначейство"}, {name: "Кассир, Инкассатор"}, {name: "Кредитный контроль"}, {name: "МСФО, IFRS"}, {name: "Налоги"}, {name: "Начальный уровень, Мало опыта"}, {name: "Основные средства"}, {name: "Оффшоры"}, {name: "Первичная документация"}, {name: "Планово-экономическое управление"}, {name: "Расчет себестоимости"}, {name: "Руководство бухгалтерией"}, {name: "ТМЦ"}, {name: "Учет заработной платы"}, {name: "Учет счетов и платежей"}, {name: "Финансовый анализ"}, {name: "Финансовый контроль"}, {name: "Финансовый менеджмент"}, {name: "Ценные бумаги"}, {name: "Экономист"}])
specializations.each{|s| s.scope = Scope.find_by_name("Бухгалтерия, управленческий учет, финансы предприятия"); s.save}

@camrades = []

5.times do |i|
  c = Camrade.create(:first_name => "Camrade#{i}", :email => "camrade#{i}@eot.su", :password => "camrade#{i}", :password_confirmation => "camrade#{i}", sex: rand(2))
  c.save
  @camrades << c
end

first = @camrades[0]
second = @camrades[1]

resumes = Resume.create([
  {title: "Программист", description: "Ruby on Rails, Java, C, Cobol, Fortran. Пишу левой задней пяткой. Лучше не берите меня на работу. Пожалеете."}, 
  {title: "Бухгалтер", description: "Умею сидеть за компьютером, проверять ексельку. Хорошая внешность. Разговорчивая и трудонелюбивая."},
  {title: "Верстальщик", description: "Владею следующими средствами вёрстки. Руки, ноги, TeX, HTML, Word. Пацан я клёвый, да и верстаю нормально, так что давай, зови меня."}
])
first.resumes << Resume.find_by_title("Программист")
first.resumes[0].specialization_names = "Web инженер, Web мастер, Администратор баз данных"
first.resumes << Resume.find_by_title("Верстальщик")
first.resumes[1].specialization_names = "Интернет, Оптимизация сайта (SEO), Стартапы"
second.resumes << Resume.find_by_title("Бухгалтер")
second.resumes[0].specialization_names = "Бухгалтер, Бухгалтер-калькулятор"

# 
# <li><label class="form-box m-form-box_radio"><input type="checkbox" name="specializationId" value=".*?"/><span>(.+?)</span></label></li>
# {name: "$1"}, 